/*
const input = `마파두부 덮밥,5000
두부강정 야채비빔밥,4800
두부연근튀김,3000
리얼 티라미수 찰떡,1500
후라이드 순살(중),7000
후라이드 순살(소)_양념치킨소스,3500
후라이드 순살(소)_케이준소스,3500
매화(치킨 / 연어구이),10000
매화(순살 고등어 간장구이),10000
진달래,7000
개나리(순살 고등어 간장구이),8000
치킨스테이크 스페셜,10000
돈까스도련님고기고기,5600
탕수육도련님고기고기,5800
새치 고기고기,6000
돈치 고기고기,5300
고기고기,4200
숯불직화구이,6500
소불고기,5000
메가치킨제육,6900
칠리 찹쌀탕수육도련님,4200
동백,5200
치킨제육,4400
돈까스도련님,4000
제육볶음,4100
돈치스팸 도시락,4600
고추장숯불삼겹정식,9000
숯불삼겹정식,8500
제육 김치찌개 정식,8000
돈치스팸 김치찌개 정식,8000
빅치킨마요 김치찌개 정식,6900
치킨마요 김치찌개 정식,6300
메가스팸마요,5600
스팸마요,3600
비벼먹는 치킨마요 김밥,4300
비벼먹는 참치마요 김밥,4300
비벼먹는 소불고기마요 김밥,4300
메가치킨마요,5300
왕치킨마요,4300
빅치킨마요,3600
치킨마요,3000
참치마요,3000
돈치마요,3600
치즈 카레도시락,4100
돈까스 카레,4100
3종치즈 김치볶음밥,4800
스팸 김치볶음밥,4600
김치볶음밥,3900
스팸철판볶음밥,4500
소불고기 철판볶음밥,4500
소고기 육개장,4700
묵은지 김치찌개,4500
고추장숯불삼겹덮밥,6500
숯불직화구이 덮밥,5700
왕카레돈까스덮밥,5600
치킨스테이크 덮밥,5700
새우돈까스 덮밥,3900
돈까스 덮밥,3800
소불고기 감초고추장 비빔밥,4800
시골제육 두부강된장 비빔밥,4800
참치야채 감초고추장,3200
열무 두부강된장 비빔밥,4300
튼튼도시락,5000`;
let value = input.split("\n").map((v) => v.trim().split(","));
value = value.map((v) =>
  v.map((v2, index) => (index === 1 ? parseInt(v2) : v2))
);
let arr = "";
value.forEach((v) => {
  arr += `{ menu: "${v[0]}", price: ${v[1]} },`;
});
//{ menu: "HansotMenu", price: 100 },
console.log(arr);
*/
const input = `반찬 계란말이,"2,500원"
반찬 치즈계란말이,"3,000원"
반찬 묵은지김치찌개,"3,900원"
반찬 소고기육개장,"4,300원"
반찬 카레,"2,600원"
반찬 소불고기,"3,900원"
반찬 순살 고등어데리야끼,"3,600원"
반찬 치킨,"3,300원"
반찬 고기고기,"3,200원"
반찬 돈까스 도련님,"3,300원"
반찬 제육볶음,"3,100원"
반찬 토네이도 소세지,"2,600원"
반찬 돈까스,"2,600원"
리얼꿀 미니호떡,"2,200원"
바삭 군만두,"2,000원"
미니 찹쌀핫도그,"2,500원"
미니 찹쌀탕수육,"2,200원"
감자고로케,"2,200원"
케이준후라이,"1,500원"
고메이 크림 고로케,"3,500원"
국물떡볶이 & 토네이도소세지 튀김set,"5,300원"
국물 떡볶이,"3,000원"
토네이도 소세지 튀김세트,"2,900원"
찹쌀탕수육박스(대),"10,000원"
찹쌀탕수육박스(중),"5,000원"
오리지널 닭강정(중),"7,500원"
오리지널 닭강정(소),"2,800원"
치킨 BOX(대),"10,000원"
치킨BOX(중)_양식소스,"5,000원"
치킨BOX(중)_타르타르소스,"5,000원"
오징어젓갈,400원
오이지무침,700원
한솥 두부강된장소스,"1,800원"
한솥 감초볶음고추장소스,500원
볶음김치,400원
김치,300원
무말랭이 무침,300원
한솥밥,"1,000원"
현미밥,"1,700원"
아이스 애플망고,"1,500원"`;
